bench/custom/logs/fuse/ramdisk/libaio/fuse_write_0-1.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=101010: Thu May 30 00:43:11 2024
  write: IOPS=220k, BW=860MiB/s (902MB/s)(32.0GiB/38090msec); 0 zone resets
    slat (usec): min=11, max=192378, avg=127.79, stdev=182.74
    clat (nsec): min=318, max=12731k, avg=721.25, stdev=6417.56
     lat (usec): min=11, max=192381, avg=128.52, stdev=183.11
    clat percentiles (nsec):
     |  1.00th=[  382],  5.00th=[  490], 10.00th=[  524], 20.00th=[  540],
     | 30.00th=[  548], 40.00th=[  556], 50.00th=[  588], 60.00th=[  620],
     | 70.00th=[  636], 80.00th=[  660], 90.00th=[  716], 95.00th=[ 2128],
     | 99.00th=[ 2576], 99.50th=[ 2704], 99.90th=[ 3184], 99.95th=[ 4080],
     | 99.99th=[63744]
   bw (  KiB/s): min=692880, max=2585121, per=100.00%, avg=995915.17, stdev=14873.45, samples=2146
   iops        : min=173220, max=646279, avg=248978.31, stdev=3718.36, samples=2146
  lat (nsec)   : 500=5.25%, 750=86.94%, 1000=1.62%
  lat (usec)   : 2=0.40%, 4=5.73%, 10=0.03%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=1.04%, sys=5.99%, ctx=8413746, majf=0, minf=334
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=860MiB/s (902MB/s), 860MiB/s-860MiB/s (902MB/s-902MB/s), io=32.0GiB (34.4GB), run=38090-38090msec