bench/custom/logs/fuse/ramdisk/libaio/fuse_write_0-15.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=124488: Thu May 30 00:47:54 2024
  write: IOPS=503k, BW=1965MiB/s (2060MB/s)(32.0GiB/16676msec); 0 zone resets
    slat (usec): min=12, max=10459, avg=62.16, stdev=15.71
    clat (nsec): min=325, max=187976, avg=838.27, stdev=385.27
     lat (usec): min=12, max=10460, avg=63.00, stdev=15.74
    clat percentiles (nsec):
     |  1.00th=[  466],  5.00th=[  556], 10.00th=[  572], 20.00th=[  628],
     | 30.00th=[  692], 40.00th=[  748], 50.00th=[  788], 60.00th=[  836],
     | 70.00th=[  900], 80.00th=[  996], 90.00th=[ 1128], 95.00th=[ 1240],
     | 99.00th=[ 1928], 99.50th=[ 2224], 99.90th=[ 3024], 99.95th=[ 4576],
     | 99.99th=[13376]
   bw (  MiB/s): min= 1827, max= 2122, per=100.00%, avg=1967.90, stdev= 2.78, samples=1056
   iops        : min=467828, max=543252, avg=503781.55, stdev=712.57, samples=1056
  lat (nsec)   : 500=1.57%, 750=39.44%, 1000=39.02%
  lat (usec)   : 2=19.12%, 4=0.79%, 10=0.03%, 20=0.02%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=3.03%, sys=12.86%, ctx=8388833, majf=0, minf=655
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1965MiB/s (2060MB/s), 1965MiB/s-1965MiB/s (2060MB/s-2060MB/s), io=32.0GiB (34.4GB), run=16676-16676msec