bench/custom/logs/fuse/ramdisk/libaio/fuse_write_0.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=100913: Thu May 30 00:41:16 2024
  write: IOPS=110k, BW=430MiB/s (451MB/s)(32.0GiB/76215msec); 0 zone resets
    slat (usec): min=11, max=47946, avg=286.94, stdev=106.64
    clat (nsec): min=316, max=37921k, avg=853.24, stdev=31182.04
     lat (usec): min=11, max=47948, avg=287.79, stdev=114.50
    clat percentiles (nsec):
     |  1.00th=[   516],  5.00th=[   548], 10.00th=[   564], 20.00th=[   588],
     | 30.00th=[   612], 40.00th=[   628], 50.00th=[   652], 60.00th=[   684],
     | 70.00th=[   708], 80.00th=[   748], 90.00th=[   812], 95.00th=[  2128],
     | 99.00th=[  2416], 99.50th=[  2576], 99.90th=[  3216], 99.95th=[  4192],
     | 99.99th=[175104]
   bw (  KiB/s): min=426730, max=719170, per=100.00%, avg=442975.08, stdev=902.63, samples=4816
   iops        : min=106682, max=179791, avg=110743.32, stdev=225.65, samples=4816
  lat (nsec)   : 500=0.57%, 750=80.04%, 1000=13.21%
  lat (usec)   : 2=0.19%, 4=5.94%, 10=0.04%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=0.51%, sys=2.63%, ctx=8409117, majf=0, minf=341
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=430MiB/s (451MB/s), 430MiB/s-430MiB/s (451MB/s-451MB/s), io=32.0GiB (34.4GB), run=76215-76215msec