bench/custom/logs/fuse/ramdisk/libaio/fuse_write_ramdisk_none.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=43984: Thu May 30 03:43:55 2024
  write: IOPS=598k, BW=2335MiB/s (2448MB/s)(32.0GiB/14034msec); 0 zone resets
    slat (usec): min=12, max=4520, avg=51.08, stdev=17.30
    clat (nsec): min=344, max=371783, avg=883.72, stdev=346.38
     lat (usec): min=13, max=4523, avg=51.97, stdev=17.33
    clat percentiles (nsec):
     |  1.00th=[  458],  5.00th=[  516], 10.00th=[  564], 20.00th=[  668],
     | 30.00th=[  772], 40.00th=[  828], 50.00th=[  868], 60.00th=[  916],
     | 70.00th=[  972], 80.00th=[ 1048], 90.00th=[ 1176], 95.00th=[ 1304],
     | 99.00th=[ 1592], 99.50th=[ 1720], 99.90th=[ 2256], 99.95th=[ 4256],
     | 99.99th=[10944]
   bw (  MiB/s): min= 1688, max= 3135, per=100.00%, avg=2367.42, stdev= 9.49, samples=877
   iops        : min=432334, max=802710, avg=606058.49, stdev=2430.51, samples=877
  lat (nsec)   : 500=3.75%, 750=23.52%, 1000=46.45%
  lat (usec)   : 2=26.11%, 4=0.13%, 10=0.04%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=3.92%, sys=21.95%, ctx=8391423, majf=0, minf=858
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2335MiB/s (2448MB/s), 2335MiB/s-2335MiB/s (2448MB/s-2448MB/s), io=32.0GiB (34.4GB), run=14034-14034msec